In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('../../data/aulas/titanic.csv')

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [5]:
pd.get_dummies(titanic.sex)

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [6]:
sex = pd.get_dummies(titanic.sex)

In [7]:
titanic[['female', 'male']] = sex

In [8]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,female,male
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0,1

In [11]:
titanic.drop(['sex'], axis=1, inplace=True)

In [12]:
titanic.head()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,female,male
0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0,1
1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0
2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1,0
3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0
4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0,1

In [13]:
titanic.drop(['male'], axis=1, inplace=True)

In [14]:
titanic.head()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,female
0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0
1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0

In [17]:
titanic.loc[(titanic.female == 0) & (titanic.who == 'woman') | (titanic.female == 1) & (titanic.who == 'man')]

Empty DataFrame
Columns: [survived, pclass, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone, female]
Index: []

In [18]:
titanic.loc[(titanic.survived == 0) & (titanic.alive == 'yes') | (titanic.survived == 1) & (titanic.alive == 'no')]

Empty DataFrame
Columns: [survived, pclass, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone, female]
Index: []

In [19]:
titanic.drop(['who', 'alive'], axis=1, inplace=True)

In [20]:
titanic

,survived,pclass,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alone,female
0,0,3,22.0,1,0,7.2500,S,Third,True,NaN,Southampton,False,0
1,1,1,38.0,1,0,71.2833,C,First,False,C,Cherbourg,False,1
2,1,3,26.0,0,0,7.9250,S,Third,False,NaN,Southampton,True,1
3,1,1,35.0,1,0,53.1000,S,First,False,C,Southampton,False,1
4,0,3,35.0,0,0,8.0500,S,Third,True,NaN,Southampton,True,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,Second,True,NaN,Southampton,True,0
887,1,1,19.0,0,0,30.0000,S,First,False,B,Southampton,True,1
888,0,3,NaN,1,2,23.4500,S,Third,False,NaN,Southampton,False,1
889,1,1,26.0,0,0,30.0000,C,First,True,C,Cherbourg,True,0
890,0,3,32.0,0,0,7.7500,Q,Third,True,NaN,Queenstown,True,0

In [21]:
pd.get_dummies(titanic.embark_town)

     Cherbourg  Queenstown  Southampton
0            0           0            1
1            1           0            0
2            0           0            1
3            0           0            1
4            0           0            1
..         ...         ...          ...
886          0           0            1
887          0           0            1
888          0           0            1
889          1           0            0
890          0           1            0

[891 rows x 3 columns]

In [23]:
titanic[['Queenstown', 'Southampton']] = pd.get_dummies(titanic.embark_town).drop(['Cherbourg'], axis=1)

In [25]:
titanic.drop(['embark_town'], axis=1, inplace=True)

In [26]:
titanic

,survived,pclass,age,sibsp,parch,fare,embarked,class,adult_male,deck,alone,female,Queenstown,Southampton
0,0,3,22.0,1,0,7.2500,S,Third,True,NaN,False,0,0,1
1,1,1,38.0,1,0,71.2833,C,First,False,C,False,1,0,0
2,1,3,26.0,0,0,7.9250,S,Third,False,NaN,True,1,0,1
3,1,1,35.0,1,0,53.1000,S,First,False,C,False,1,0,1
4,0,3,35.0,0,0,8.0500,S,Third,True,NaN,True,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,Second,True,NaN,True,0,0,1
887,1,1,19.0,0,0,30.0000,S,First,False,B,True,1,0,1
888,0,3,NaN,1,2,23.4500,S,Third,False,NaN,False,1,0,1
889,1,1,26.0,0,0,30.0000,C,First,True,C,True,0,0,0
890,0,3,32.0,0,0,7.7500,Q,Third,True,NaN,True,0,1,0